/**
 * 资产负债表资产
 * [流动资产、非流动资产]
 * 负债[流动负债、非流动负债、]
 * 所有者权益
 */
export class BalanceOutputModel {
    // 流动资产
    F019_THS013?: any[] = []; // 货币资金
    F020_THS013?: any[] = []; // 以公允价值计量且其变动计入当期损益的金融资产
    F057_THS013?: any[] = []; // 衍生金融资产
    F021_THS013?: any[] = []; // 应收票据
    F022_THS013?: any[] = []; // 应收账款
    F023_THS013?: any[] = []; // 预付款项
    F024_THS013?: any[] = []; // 应收利息
    F025_THS013?: any[] = []; // 应收股利
    F026_THS013?: any[] = []; // 其他应收款
    F027_THS013?: any[] = []; // 存货
    F028_THS013?: any[] = []; // 一年内到期的非流动资产
    F029_THS013?: any[] = []; // 其他流动资产
    F032_THS013?: any[] = []; // 流动资产合计

    // 非流动
    F033_THS013?: any[] = []; // 可供出售金融资产
    F034_THS013?: any[] = []; // 持有至到期投资
    F035_THS013?: any[] = []; // 长期应收款
    F036_THS013?: any[] = []; // 长期股权投资
    F037_THS013?: any[] = []; // 投资性房地产
    F038_THS013?: any[] = []; // 固定资产
    F039_THS013?: any[] = []; // 在建工程
    F040_THS013?: any[] = []; // 工程物资
    F041_THS013?: any[] = []; // 固定资产清理
    F042_THS013?: any[] = []; // 生产性生物资产
    F043_THS013?: any[] = []; // 油气资产
    F044_THS013?: any[] = []; // 无形资产
    F045_THS013?: any[] = []; // 开发支出
    F046_THS013?: any[] = []; // 商誉
    F047_THS013?: any[] = []; // 长期待摊费用
    F048_THS013?: any[] = []; // 递延所得税资产
    F049_THS013?: any[] = []; // 其他非流动资产
    F052_THS013?: any[] = []; // 非流动资产合计
    F080_THS013?: any[] = []; // 资产总计

    // 流动负债
    F081_THS013?: any[] = []; // 短期借款
    F082_THS013?: any[] = []; // 以公允价值计量且其变动计入当期损益的金融负债
    F109_THS013?: any[] = []; // 衍生金融负债
    F083_THS013?: any[] = []; // 应付票据
    F084_THS013?: any[] = []; // 应付账款
    F085_THS013?: any[] = []; // 预付款项
    F086_THS013?: any[] = []; // 应付职工薪酬
    F087_THS013?: any[] = []; // 应交税费
    F088_THS013?: any[] = []; // 应付利息
    F089_THS013?: any[] = []; // 应付股利
    F090_THS013?: any[] = []; // 其他应付款
    F091_THS013?: any[] = []; // 一年内到期的非流动负债
    F092_THS013?: any[] = []; // 其他流动负债
    F095_THS013?: any[] = []; // 流动负债合计

    // 非流动负债
    F096_THS013?: any[] = []; // 长期借款
    F097_THS013?: any[] = []; // 应付债券
    F098_THS013?: any[] = []; // 长期应付款
    F099_THS013?: any[] = []; // 长期应付款
    F100_THS013?: any[] = []; // 预计负债
    F153_THS013?: any[] = []; // 递延收益
    F101_THS013?: any[] = []; // 递延所得税负债
    F102_THS013?: any[] = []; // 其他非流动负债
    F105_THS013?: any[] = []; // 非流动负债合计
    F129_THS013?: any[] = []; // 负债合计

    // 所有者权益
    F130_THS013?: any[] = []; // 实收资本(或股本)
    F161_THS013?: any[] = []; // 其他权益工具
    F162_THS013?: any[] = []; // 优先股
    F163_THS013?: any[] = []; // 永续债
    F131_THS013?: any[] = []; // 资本公积
    F132_THS013?: any[] = []; // 减:库存股
    F159_THS013?: any[] = []; //  其他综合收益
    F134_THS013?: any[] = []; //  盈余公积
    F137_THS013?: any[] = []; //  未分配利润
    F143_THS013?: any[] = []; // 所有者权益(或股东权益)合计
    F144_THS013?: any[] = []; // 负债和所有者权益(或股东权益)总计


}

/**
 * 利润表
 */
export class ProfitOutputModel {
    F021_THS014?: any[] = []; // 一、营业收入
    F039_THS014?: any[] = []; // 减:营业成本
    F040_THS014?: any[] = []; // 营业税金及附加
    F041_THS014?: any[] = []; // 销售费用
    F042_THS014?: any[] = []; // 管理费用
    F043_THS014?: any[] = []; // 财务费用
    F044_THS014?: any[] = []; // 资产减值损失
    F057_THS014?: any[] = []; // 加:公允价值变动收益(损失以"-"号填列)
    F058_THS014?: any[] = []; // 投资收益(损失以"-"号填列)
    F059_THS014?: any[] = []; // 其中:对联营企业和合营企业的投资收益
    F101_THS014?: any[] = []; // 资产处置收益（损失以“-”号填列）
    F100_THS014?: any[] = []; // 其他收益

    F061_THS014?: any[] = []; // 二、营业利润(亏损以"-"号填列)
    F062_THS014?: any[] = []; // 加:营业外收入
    F063_THS014?: any[] = []; // 减:营业外支出

    F065_THS014?: any[] = []; // 三、利润总额(亏损总额以"-"号填列)
    F066_THS014?: any[] = []; // 减:所得税费用

    F067_THS014?: any[] = []; // 四、净利润(净亏损以"-"号填列)
    F102_THS014?: any[] = []; // 持续经营净利润（净亏损以“－”号填列）
    F103_THS014?: any[] = []; // 终止经营净利润（净亏损以“－”号填列）

    // 五、每股收益
    F083_THS014?: any[] = []; // (一)基本每股收益
    F084_THS014?: any[] = []; // (二)稀释每股收益

    F070_THS014?: any[] = []; // 六、其他综合收益的税后净额
    F088_THS014?: any[] = []; // (一)以后不能重分类进损益的其他综合收益
    F089_THS014?: any[] = []; // 1.重新计量设定受益计划净负债或净资产的变动
    F090_THS014?: any[] = []; // 2.权益法下在被投资单位不能重分类进损益的其他综合收益中享有的份额

    F091_THS014?: any[] = []; // (二)以后将重分类进损益的其他综合收益
    F092_THS014?: any[] = []; // 1.权益法下在被投资单位以后将重分类进损益的其他综合收益中享有的份额
    F093_THS014?: any[] = []; // 2.可供出售金融资产公允价值变动损益
    F094_THS014?: any[] = []; // 3.持有至到期投资重分类为可供出售金融资产损益
    F095_THS014?: any[] = []; // 4.现金流量套期损益的有效部分
    F096_THS014?: any[] = []; // 5.外币财务报表折算差额

    F071_THS014?: any[] = []; // 七、综合收益总额

    F038_THS014?: any[] = []; // 营业总成本
}

/**
 *  现金流量表
 *  1、经营活动产生的现金流量
 *  2、投资活动产生的现金流量
 *  3、筹资活动产生的现金流量
 */
export class CashOutputModel {
    // 经营活动产生的现金流量
    F020_THS015?: any[] = []; // 销售商品、提供劳务收到的现金
    F021_THS015?: any[] = []; // 收到的税费返还
    F022_THS015?: any[] = []; // 收到的其他与经营活动有关的现金
    F034_THS015?: any[] = []; // 经营活动现金流入小计
    F035_THS015?: any[] = []; // 购买商品、接受劳务支付的现金
    F036_THS015?: any[] = []; // 支付给职工以及为职工支付的现金
    F037_THS015?: any[] = []; // 支付的各项税费
    F038_THS015?: any[] = []; // 支付其他与经营活动有关的现金
    F046_THS015?: any[] = []; // 经营活动现金流出小计
    F047_THS015?: any[] = []; // 经营活动产生的现金流量净额

    // 投资活动产生的现金流量
    F048_THS015?: any[] = []; // 收回投资收到的现金
    F049_THS015?: any[] = []; // 取得投资收益收到的现金
    F050_THS015?: any[] = []; // 处置固定资产、无形资产和其他长期资产收回的现金净额
    F051_THS015?: any[] = []; // 处置子公司及其他营业单位收到的现金净额
    F052_THS015?: any[] = []; // 收到其他与投资活动有关的现金
    F054_THS015?: any[] = []; // 投资活动现金流入小计
    F055_THS015?: any[] = []; // 购建固定资产、无形资产和其他长期资产支付的现金
    F056_THS015?: any[] = []; // 投资支付的现金
    F057_THS015?: any[] = []; // 取得子公司及其他营业单位支付的现金净额
    F058_THS015?: any[] = []; // 支付其他与投资活动有关的现金
    F061_THS015?: any[] = []; // 投资活动现金流出小计
    F062_THS015?: any[] = []; // 投资活动产生的现金流量净额

    // 筹资活动产生的现金流量
    F063_THS015?: any[] = []; // 吸收投资收到的现金
    F065_THS015?: any[] = []; // 取得借款收到的现金
    F066_THS015?: any[] = []; // 收到其他与筹资活动有关的现金
    F069_THS015?: any[] = []; // 筹资活动现金流入小计
    F070_THS015?: any[] = []; // 偿还债务支付的现金
    F071_THS015?: any[] = []; // 分配股利、利润或偿付利息支付的现金
    F073_THS015?: any[] = []; // 支付其他与筹资活动有关的现金
    F075_THS015?: any[] = []; // 筹资活动现金流出小计
    F076_THS015?: any[] = []; // 筹资活动产生的现金流量净额
    F077_THS015?: any[] = []; // 四、汇率变动对现金及现金等价物的影响
    F078_THS015?: any[] = []; // 五、现金及现金等价物净增加额
    F079_THS015?: any[] = []; // 加:期初现金及现金等价物余额
    F080_THS015?: any[] = []; // 六、期末现金及现金等价物余额

}

class OutputModel {
}
